; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image2 - mode
	thermograph0 - mode
	image1 - mode
	infrared3 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	Star1 - direction
	Star4 - direction
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star4)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph4)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument4 image1)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument7 spectrograph4)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star2)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite1 Star4)
	(pointing satellite3 GroundStation3)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 infrared3)
	(have_image Planet7 image2)
	(have_image Planet8 image1)
	(have_image Star9 spectrograph4)
	(have_image Star10 spectrograph4)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation3 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite2 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite2 star10 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star10)
   goals met: 0 of 9
5. (take_image satellite2 star10 instrument4 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 1 of 9
6. (turn_to satellite2 planet8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet8)
   goals met: 1 of 9
7. (take_image satellite2 planet8 instrument4 image1)
   added: (have_image planet8 image1)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon6)
   goals met: 2 of 9
9. (turn_to satellite1 star4 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star4)
   goals met: 3 of 9
10. (turn_to satellite0 star2 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star2)
   goals met: 3 of 9
11. (take_image satellite2 phenomenon6 instrument4 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 4 of 9
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
13. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 4 of 9
14. (turn_to satellite0 planet11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet11)
   goals met: 4 of 9
15. (take_image satellite0 planet11 instrument1 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 9
16. (turn_to satellite0 planet7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet7)
   goals met: 5 of 9
17. (take_image satellite0 planet7 instrument1 image2)
   added: (have_image planet7 image2)
   goals met: 6 of 9
18. (turn_to satellite2 star5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star5)
   goals met: 6 of 9
19. (take_image satellite2 star5 instrument4 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 7 of 9
20. (turn_to satellite2 star9 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star9)
   goals met: 7 of 9
21. (take_image satellite2 star9 instrument4 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 9
22. (turn_to satellite3 groundstation3 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 groundstation3)
   goals met: 9 of 9
